// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");

// *****************Задача 1**********************************
// Напишите программу, которая принимает на вход число (А) и выдаёт сумму чисел от 1 до А.
// 7 -> 28
// 4 -> 10
// 8 -> 36
Console.WriteLine("Введите число");
int A=Convert.ToInt32(Console.ReadLine());
