// ___**Задача 1**_____
// Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
// a = 5; b = 7 -> max = 7
// a = 2 b = 10 -> max = 10
// a = -9 b = -3 -> max = -3
//_____Решение______
// Console.WriteLine("Hello, World!");
// Console.WriteLine("Введи первое число");
// int num=Convert.ToInt32 (Console.ReadLine());
// Console.WriteLine("Введи второе число");
// int num1=Convert.ToInt32 (Console.ReadLine());
// if (num>num1)
// {
//     Console.WriteLine("Большее: "); 
//     Console.WriteLine(num);
//     Console.WriteLine("Меньшее: "); 
//     Console.WriteLine(num1);
// }
// else if (num1>num)
// {
//    Console.WriteLine("Большее: "); 
//    Console.WriteLine(num1);
//    Console.WriteLine("Меньшее: "); 
//    Console.WriteLine(num);
// }
// else if (num==num1)
// {
//     Console.WriteLine("Они равны");
// }
//____Конец___

// ___**Задача 2**___
// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22
//____Решение_____
// Console.WriteLine("Введи первое число");
// int a=Convert.ToInt32 (Console.ReadLine());
// Console.WriteLine("Введи второе число");
// int b=Convert.ToInt32 (Console.ReadLine());
// Console.WriteLine("Введи третье число");
// int c=Convert.ToInt32 (Console.ReadLine());
// int max=a;
// if (a>b)
// {
//     if (a>c)
//     {
//         max=a;
//     }
//     else max=c; 
// }
// else if (b>c)
// {
//     max=b;  
// }
// else max=c;
// Console.WriteLine("Самое большое:");
// Console.WriteLine(max);
//___Конец___

//____**Задача 3**_____
//Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
// 4 -> да
// -3 -> нет
// 7 -> нет
//____Решение____
// Console.WriteLine("Введи число");
// int a=Convert.ToInt32 (Console.ReadLine());
// int num=a%=2;
// if (num>0)
// {
//     Console.WriteLine("Нет");
// }
// else Console.WriteLine("да");
// ___Конец___

// _____**Задача 4**_____
